[{"time":1519526834,"title":"A popular streamer started accepting crypto in donations, this is how he thanks them","score":6888},{"time":1519512817,"title":"I said something romantic to the girl I'm dating...","score":419},{"time":1519520291,"title":"Andreas Antonopoulos about a 51% Attack","score":376},{"time":1519541149,"title":"\"There are no controls over how many Bitcoins are issued, and digital counterfeiting rings have been busy replicating the currency at “Bitcoin farms”, and a few have been apprehended.\" This \"Journalist should be fired on Monday Morning\"","score":332},{"time":1519558504,"title":"BREAKING: Putin Fully Endorses Blockchain Technology: \"Russia Has Oil and Gas But We Need Cryptos. He who is late to this race will be under full dependence from the leaders of these processes\".","score":320},{"time":1519547657,"title":"wow! This is how it looks 2832 nodes &amp; 15747 channels to testnet lightning network","score":232},{"time":1519552908,"title":"Laszlo Hanyecz of Pizza fame and history does it again with Lightning mainnet","score":160},{"time":1519537765,"title":"JPMorgan trader now trades bitcoin and feels banks cannot catch up with crypto","score":113},{"time":1519516728,"title":"Bit of a dumb question, but what made Bitcoin so popular so suddenly?","score":96},{"time":1519530228,"title":"Georgia Looks To Join Arizona In Accepting Bitcoin For Tax Payment.","score":92},{"time":1519516602,"title":"The convulsive household debt has surpassed the bubble of 2008 and is still escalating. &lt;- Got Bitcoin?","score":83},{"time":1519523431,"title":"quotes from Satoshi forming into the Bitcoin logo with the \"Chancellor on brink of second bailout for banks\" subtly placed in the background.","score":74},{"time":1519562451,"title":"BITCOIN is becoming the national currency for Liberland","score":73},{"time":1519554736,"title":"\"He who is late to this race will be under full dependence from the leaders of these processes.\" - Vladimir Putin, on securing blockchain tech for the National Security of Russia","score":70},{"time":1519567760,"title":"\"Email first entered limited use in the 1960s and by the mid-1970s had taken the form now recognized as email.\"-wikipedia | This video shows how to send an Email in 1984. We're witnessing Bitcoin move beyond this phase of inaccessibility, with layer 2 development and smart contracts","score":67},{"time":1519562938,"title":"Pizza for Lightning: Bitcoin Legend Laszlo Eats Again!","score":63},{"time":1519512470,"title":"ECB Member Detained in Anti-Corruption Probe (But Banks Continue to Finger Bitcoin as the Problem)","score":51},{"time":1519537022,"title":"Headphone user advisory. ","score":514},{"time":1519512964,"title":"Dump her.","score":190}]